PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_crypto_core_trng.h
    return status;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_IsRandomComplete
****************************************************************************//**
*
* Checks for TRNG random number generation is complete.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* true when TRNG random number generation is complete, otherwise false.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_Crypto_Core_Trng_IsRandomComplete(CRYPTO_Type *base)
{
    uint32_t status;

    /* Check for TRNG instruction is complete */
    status = Cy_Crypto_Core_GetInterruptStatus(base) & (CRYPTO_INTR_TR_DATA_AVAILABLE_Msk | CRYPTO_INTR_TR_AP_DETECT_ERROR_Msk | CRYPTO_INTR_TR_RC_DETECT_ERROR_Msk);

    return (status != 0UL);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_IsInitialized
****************************************************************************//**
*
* Checks for TRNG hardware is initialized.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* true when TRNG hardware is initialized, otherwise false.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_Crypto_Core_Trng_IsInitialized(CRYPTO_Type *base)
{
    return ((Cy_Crypto_Core_GetInterruptStatus(base) & CRYPTO_INTR_TR_INITIALIZED_Msk) != 0U);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_WaitForComplete
****************************************************************************//**
*
* Waits for TRNG random generation is complete.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \note
* After this call the Health Monitor status should be checked to ensure that
* random data is healthy.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Crypto_Core_Trng_WaitForComplete(CRYPTO_Type *base)
{
    uint32_t status;
    /* Wait until the TRNG random generation is complete */
    do
    {
        status = Cy_Crypto_Core_GetInterruptStatus(base) & (CRYPTO_INTR_TR_DATA_AVAILABLE_Msk  |
                 CRYPTO_INTR_TR_AP_DETECT_ERROR_Msk |
                 CRYPTO_INTR_TR_RC_DETECT_ERROR_Msk);
    }
    while (status == 0U);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_WaitForReady
****************************************************************************//**
*
* Waits for TRNG operation is ready.
*
* \param base
* The pointer to the CRYPTO instance.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Crypto_Core_Trng_WaitForReady(CRYPTO_Type *base)
{
    /* Wait until the TRNG instruction is complete */
    if (CY_CRYPTO_V1)
    {
#if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
        while (0uL != (REG_CRYPTO_STATUS(base) & CRYPTO_STATUS_TR_BUSY_Msk))
        {
        }
#endif
    }
    else
    {
#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
        while (0uL != REG_CRYPTO_STATUS(base))
        {
        }
#endif
    }
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_GetRoStatus
****************************************************************************//**
*
* Reads the ring oscillator enable status.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param roSelector
* The ring oscillator selector (see \ref cy_en_crypto_trng_ro_sel_t).
*
* \return
* The ring oscillator enabled status (0 or 1).
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_Crypto_Core_Trng_GetRoStatus(CRYPTO_Type *base, cy_en_crypto_trng_ro_sel_t roSelector)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to wider 32bit.');
    return (REG_CRYPTO_TR_CTL1(base) & (uint32_t)(1U << ((uint32_t)roSelector))) != 0U ? 1U : 0U;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_SetRoStatus
****************************************************************************//**
*
* Sets the ring oscillator enable status.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param roSelector
* The ring oscillator selector (see \ref cy_en_crypto_trng_ro_sel_t).
*
* \param roStatus
* The new ring oscillator status value (0 or 1).
*
*******************************************************************************/
__STATIC_INLINE void Cy_Crypto_Core_Trng_SetRoStatus(CRYPTO_Type *base,
        cy_en_crypto_trng_ro_sel_t roSelector, uint8_t roStatus)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.6', 'enum cy_en_crypto_trng_ro_sel_t to uint32_t conversion intentional.');
    uint32_t roMask = 1U << (uint32_t)roSelector;
    uint32_t roData = (REG_CRYPTO_TR_CTL1(base) & ~roMask) | (((uint32_t)roStatus != 0U) ? roMask : 0U);
    REG_CRYPTO_TR_CTL1(base) = roData;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_IsRoEnabled
****************************************************************************//**
*
* Checks if the specified ring oscillator is enabled.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param roSelector
* The ring oscillator selector (see \ref cy_en_crypto_trng_ro_sel_t).
*
* \return
* true - if the ring oscillator is enabled otherwise false.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_Crypto_Core_Trng_IsRoEnabled(CRYPTO_Type *base, cy_en_crypto_trng_ro_sel_t roSelector)
{
    return (Cy_Crypto_Core_Trng_GetRoStatus(base, roSelector) != 0U);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_AnyRoEnabled
****************************************************************************//**
*
* Checks if any ring oscillator is enabled.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param roSelector
* The ring oscillator selector (see \ref cy_en_crypto_trng_ro_sel_t).
*
* \return
* true - if at least one ring oscillator is enabled otherwise false.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_Crypto_Core_Trng_AnyRoEnabled(CRYPTO_Type *base)
{
    return ((REG_CRYPTO_TR_CTL1(base) & CY_CRYPTO_TRNG_RO_ALL_MASK) != 0U);
}


