PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_crypto_core_trng.h
/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_GetData
****************************************************************************//**
*
* Reads the generated random number in non-blocking mode.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The generated random number.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_Crypto_Core_Trng_GetData(CRYPTO_Type *base)
{
    return REG_CRYPTO_TR_RESULT(base);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_SetData
****************************************************************************//**
*
* Sets the random number value.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param randomData
* The new random number value.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Crypto_Core_Trng_SetData(CRYPTO_Type *base, uint32_t randomData)
{
    REG_CRYPTO_TR_RESULT(base) = randomData;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_SetGaroPoly
****************************************************************************//**
*
* Sets the polynomial value for the Galois ring oscillator.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param poly
* The polynomial for the programmable Galois ring oscillator.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Crypto_Core_Trng_SetGaroPoly(CRYPTO_Type *base, uint32_t poly)
{
    REG_CRYPTO_TR_GARO_CTL(base) = poly & CRYPTO_TR_GARO_CTL_POLYNOMIAL31_Msk;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_SetFiroPoly
****************************************************************************//**
*
* Sets the polynomial value for the Fibonacci ring oscillator.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param poly
* The polynomial for the programmable Fibonacci ring oscillator.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Crypto_Core_Trng_SetFiroPoly(CRYPTO_Type *base, uint32_t poly)
{
    REG_CRYPTO_TR_FIRO_CTL(base) = poly & CRYPTO_TR_FIRO_CTL_POLYNOMIAL31_Msk;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_GetGaroPoly
****************************************************************************//**
*
* Reads the polynomial value of the Galois ring oscillator.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The polynomial of the programmable Galois ring oscillator.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_Crypto_Core_Trng_GetGaroPoly(CRYPTO_Type *base)
{
    return REG_CRYPTO_TR_GARO_CTL(base);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_GetFiroPoly
****************************************************************************//**
*
* Reads the polynomial value of the Fibonacci ring oscillator.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The polynomial of the programmable Fibonacci ring oscillator.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_Crypto_Core_Trng_GetFiroPoly(CRYPTO_Type *base)
{
    return REG_CRYPTO_TR_FIRO_CTL(base);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonGetHealthStatus
****************************************************************************//**
*
* Returns the health status of the random number health monitor in two bits.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The health status:
*  - ZERO  - if data is healthy
*  - bit 0 - Adaptive Proportion (AP) error is detected
*  - bit 1 - Repetition Count (RC) error is detected
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_Crypto_Core_Trng_MonGetHealthStatus(CRYPTO_Type *base)
{
    return (uint8_t)((REG_CRYPTO_INTR(base) \
                      & (CRYPTO_INTR_TR_AP_DETECT_ERROR_Msk | CRYPTO_INTR_TR_RC_DETECT_ERROR_Msk)) \
                     >> CRYPTO_INTR_TR_AP_DETECT_ERROR_Pos);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonClearHealthStatus
****************************************************************************//**
*
* Clears the health status of the random number health monitor
* in the interrupts register
*
* \param base
* The pointer to the CRYPTO instance.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Crypto_Core_Trng_MonClearHealthStatus(CRYPTO_Type *base)
{
    Cy_Crypto_Core_ClearInterrupt(base, CRYPTO_INTR_TR_AP_DETECT_ERROR_Msk | CRYPTO_INTR_TR_RC_DETECT_ERROR_Msk);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonGetRcRepCount
****************************************************************************//**
*
* Reads the current number of repetitions from the repetition counter
* test monitor.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The number of repetitions of the current active bit counter.
*
*******************************************************************************/
__STATIC_INLINE uint8_t  Cy_Crypto_Core_Trng_MonGetRcRepCount(CRYPTO_Type *base)
{
    return ((uint8_t)_FLD2VAL(CRYPTO_TR_MON_RC_STATUS1_REP_COUNT, REG_CRYPTO_TR_MON_RC_STATUS1(base)));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonGetApOccCount
****************************************************************************//**
*
* Reads the current Cutoff count number from the adaptive proportion
* test monitor.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The Cutoff count number of the adaptive proportion test.
*
*******************************************************************************/
__STATIC_INLINE uint16_t Cy_Crypto_Core_Trng_MonGetApOccCount(CRYPTO_Type *base)
{
    return ((uint16_t)_FLD2VAL(CRYPTO_TR_MON_AP_STATUS1_OCC_COUNT, REG_CRYPTO_TR_MON_AP_STATUS1(base)));
}

