PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_crypto_core_trng.h
/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonGetRcCC8
****************************************************************************//**
*
* Reads the Cutoff counter value of the repetition counter test monitor.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The Cutoff counter value.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_Crypto_Core_Trng_MonGetRcCC8(CRYPTO_Type *base)
{
    return ((uint8_t)_FLD2VAL(CRYPTO_TR_MON_RC_CTL_CUTOFF_COUNT8, REG_CRYPTO_TR_MON_RC_CTL(base)));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonSetApCC16
****************************************************************************//**
*
* Sets the Cutoff counter value of the adaptive proportion test monitor.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param ccCount
* The new Cutoff counter value.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Crypto_Core_Trng_MonSetApCC16(CRYPTO_Type *base, uint16_t ccCount)
{
    CY_REG32_CLR_SET(REG_CRYPTO_TR_MON_AP_CTL(base), CRYPTO_TR_MON_AP_CTL_CUTOFF_COUNT16, ccCount);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonGetApCC16
****************************************************************************//**
*
* Reads the Cutoff counter value of the adaptive proportion test monitor.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The Cutoff counter value.
*
*******************************************************************************/
__STATIC_INLINE uint16_t Cy_Crypto_Core_Trng_MonGetApCC16(CRYPTO_Type *base)
{
    return ((uint16_t)_FLD2VAL(CRYPTO_TR_MON_AP_CTL_CUTOFF_COUNT16, REG_CRYPTO_TR_MON_AP_CTL(base)));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonSetApWinSize
****************************************************************************//**
*
* Sets the window size value of the adaptive proportion test monitor.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param windowSize
* The new windows size value.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Crypto_Core_Trng_MonSetApWinSize(CRYPTO_Type *base, uint16_t windowSize)
{
    CY_REG32_CLR_SET(REG_CRYPTO_TR_MON_AP_CTL(base), CRYPTO_TR_MON_AP_CTL_WINDOW_SIZE, windowSize);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Trng_MonGetApWinSize
****************************************************************************//**
*
* Reads the window size value of the adaptive proportion test monitor.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The windows size value.
*
*******************************************************************************/
__STATIC_INLINE uint16_t Cy_Crypto_Core_Trng_MonGetApWinSize(CRYPTO_Type *base)
{
    return ((uint16_t)_FLD2VAL(CRYPTO_TR_MON_AP_CTL_WINDOW_SIZE, REG_CRYPTO_TR_MON_AP_CTL(base)));
}





#endif /* #if (CPUSS_CRYPTO_TR == 1) && defined(CY_CRYPTO_CFG_TRNG_C) */

CY_MISRA_BLOCK_END('MISRA C-2012 Rule 14.3')

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXCRYPTO */

#endif /* #if !defined (CY_CRYPTO_CORE_TRNG_H) */


/* [] END OF FILE */
